EMAIL = "speedconnect2962@connectix.panel"
PASSWORD = "%2kZpMtsx@R8qPE7pN!Brq4wPKYc^#"
BOT_TOKEN = "6801346087:AAHsc4IPGg1NuKEbmnNr2M_kTdHKuUilG7k"
REPORT_CHANNEL_ID = -1002151987895
MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"
API_ADDRESS = "https://app-panelmyqp.ir/get.php"
plans_json = {
    1: "88db7ac0-6baf-4028-8948-6b4ce7dada60",
    2: "2492da1c-abfb-4978-99c9-0f5d9f75bf8d",
    3: "681c0977-fc70-4345-b51e-84a8dc734f6f",
    4: "de82caf4-4f08-4c61-afd7-547fd0554da6",
    5: "a53e4e62-96d0-4b5d-90a6-71723839a2b7",
    6: "a180cf18-3fc6-4d58-9fe0-a7ffb9aaaed6",
    7: "1226e5c2-326b-4ee4-8d09-2b19f1fe3c72",
    8: "5bdde050-e0dc-40ff-a766-d736c40d26ba",
    9: "625b6a0a-d789-4b65-8a75-ddf0c7364d9c",
    10: "1ed7fdc6-5ed2-464e-a5d8-5a085157bed7",
    11: "9a4869ff-05c7-4f3c-abec-f04c550be9a0",
    12: "517f6f5e-a054-431a-9689-ffa2266bec0c",
    13: "dd5813f9-1647-48c9-a700-941868e9742e",
    14: "6d2fa322-6770-4821-b8ef-5a8dcceadad9",
    15: "b923d70c-26bd-4a12-a3a6-8704d7494c31",
    16: "8cdec062-157e-4121-9d46-f291d26a856c",
    17: "391b01f9-b39f-43f1-a91b-23b09fe3f0f8",
    18: "355cfc20-10ef-4516-abf1-b87b64a6a8fd",
    19: "62117254-42c8-47a0-aba6-351dd9839446",
    20: "e9c1aaa7-0f55-4d07-b2e4-2a56f6d277d4",
    21: "4d79e0da-ae2b-42d6-a5bc-e531fe40402a",
    22: "1502637f-5ae7-485b-b70f-59dbf1f06c44",
    23: "7b5f87eb-f2bd-4d8b-a32b-19a2bb51035b"
}


iphone_amounts = {
    2: 75000,
    3: 140000,
    4: 210000,
    5: 145000,
    6: 305000,
    7: 380000,
    8: 230000,
    9: 405000,
    10: 475000,
}



iphone_data_limits = {2: 536870912000, 3: 536870912000, 4: 536870912000, 5: 536870912000, 6: 536870912000, 7: 536870912000, 8: 536870912000, 9: 536870912000, 10: 536870912000}

iphone_plan_names = {
    2: "نامحدود - یک ماهه - 75 هزار تومن",
    3: "نامحدود - دو ماهه - 140 هزار تومن",
    4: "نامحدود - سه ماهه - 210 هزار تومن",
    5: "نامحدود - یک ماهه - 145 هزار تومن",
    6: "نامحدود - دو ماهه - 305 هزار تومن",
    7: "نامحدود - سه ماهه - 380 هزار تومن",
    8: "نامحدود - یک ماهه - 230 هزار تومن",
    9: "نامحدود - دو ماهه - 405 هزار تومن",
    10: "نامحدود - سه ماهه - 475 هزار تومن",
}

iphone_expire_dates = {
    2: 30,
    3: 60,
    4: 90,
    5: 30,
    6: 60,
    7: 90,
    8: 30,
    9: 60,
    10: 90,
}



amounts = {
    2: 75000,
    3: 140000,
    4: 210000,
    5: 145000,
    6: 305000,
    7: 380000,
    8: 230000,
    9: 405000,
    10: 475000,
}


data_limits = {
    2: 500,
    3: 500,
    4: 500,
    5: 500,
    6: 500,
    7: 500,
    8: 500,
    9: 500,
    10: 500,
}

plan_names = {
    2: "نامحدود - یک ماهه - 75 هزار تومن",
    3: "نامحدود - دو ماهه - 140 هزار تومن",
    4: "نامحدود - سه ماهه - 210 هزار تومن",
    5: "نامحدود - یک ماهه - 145 هزار تومن",
    6: "نامحدود - دو ماهه - 305 هزار تومن",
    7: "نامحدود - سه ماهه - 380 هزار تومن",
    8: "نامحدود - یک ماهه - 230 هزار تومن",
    9: "نامحدود - دو ماهه - 405 هزار تومن",
    10: "نامحدود - سه ماهه - 475 هزار تومن",
}


expire_dates = {
    2: 30,
    3: 60,
    4: 90,
    5: 30,
    6: 60,
    7: 90,
    8: 30,
    9: 60,
    10: 90,
}



user_counts = {
    2: 1,
    3: 1,
    4: 1,
    5: 2,
    6: 2,
    7: 2,
    8: 3,
    9: 3,
    10: 3,
}
