EMAIL = "vorixvpn4784@connectix.panel"
PASSWORD = "qSbsijwhwDTrqhja4HJT65!VrovQ!Y"
BOT_TOKEN = "6801346087:AAHsc4IPGg1NuKEbmnNr2M_kTdHKuUilG7k"
BOT_DIR = "MmdMainBot"
REPORT_CHANNEL_ID = -1002151987895
MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"
API_ADDRESS = "https://app-panelmyqp.ir/get.php"
plans_json = {1: 'a5fda1ba-fccf-4215-b2ad-1b15d120b2ce', 2: '1eb4badb-fa8b-41ae-bbed-810afd8d4195',
              3: '662f7238-064e-49ab-9d6b-8b1bbcfce331', 4: 'f64fe3ed-bf2a-41b2-b874-3b57191ee95c',
              5: '263eed65-5bbe-4d9c-af29-119474cae071', 6: '69e09847-7570-4487-bedb-2e6f268b6544',
              7: '1233d684-d0a5-43f9-a099-804fbcea318f', 8: 'cc82fa37-03aa-4174-97ac-96417e5c0859',
              9: '762d16f1-a0cf-4212-b100-acfdd0568499', 10: '6ef8b059-ae1c-406c-aa89-9e6a9dbe3674',
              11: 'ce238760-6daf-4bec-a5df-bcc25b4cb9bf'}

iphone_amounts = {
    2: 75000,
    3: 140000,
    4: 210000,
    5: 145000,
    6: 305000,
    7: 380000,
    8: 230000,
    9: 405000,
    10: 475000,
}

iphone_data_limits = {2: 536870912000, 3: 536870912000, 4: 536870912000, 5: 536870912000, 6: 536870912000,
                      7: 536870912000, 8: 536870912000, 9: 536870912000, 10: 536870912000}

iphone_plan_names = {
    2: "نامحدود - یک ماهه - 75 هزار تومن",
    3: "نامحدود - دو ماهه - 140 هزار تومن",
    4: "نامحدود - سه ماهه - 210 هزار تومن",
    5: "نامحدود - یک ماهه - 145 هزار تومن",
    6: "نامحدود - دو ماهه - 305 هزار تومن",
    7: "نامحدود - سه ماهه - 380 هزار تومن",
    8: "نامحدود - یک ماهه - 230 هزار تومن",
    9: "نامحدود - دو ماهه - 405 هزار تومن",
    10: "نامحدود - سه ماهه - 475 هزار تومن",
}

iphone_expire_dates = {
    2: 30,
    3: 60,
    4: 90,
    5: 30,
    6: 60,
    7: 90,
    8: 30,
    9: 60,
    10: 90,
}

amounts = {
    2: 60000,
    3: 120000,
    4: 190000,
    5: 290000,
    6: 180000,
    7: 270000,
    8: 360000,
    9: 280000,
    10: 370000,
    11: 440000,
}

data_limits = {
    2: 20,
    3: 500,
    4: 500,
    5: 500,
    6: 500,
    7: 500,
    8: 500,
    9: 500,
    10: 500,
    11: 500,
}

plan_names = {
    2: "یکماهه تک کاربره اقتصادی 20 گیگ 60 تومن",
    3: "نامحدود یک ماهه تک کاربره 120،000 تومان",
    4: "نامحدود دو ماهه تک کاربره 190،000 تومان",
    5: "نامحدود سه ماهه تک کاربره 290،000 تومان",
    6: "نامحدود یک ماهه دو کاربره 180،000 تومان",
    7: "نامحدود دو ماهه دو کاربره 270،000 تومان",
    8: "نامحدود سه ماهه دو کاربره 360،000 تومانن",
    9: "نامحدود یک ماهه سه کاربره 280 تومان",
    10: "نامحدود دو ماهه سه کاربره 370 تومان",
    11: "نامحدود سه ماهه سه کاربره 440 تومان"
}

expire_dates = {
    2: 30,
    3: 30,
    4: 60,
    5: 90,
    6: 30,
    7: 60,
    8: 90,
    9: 30,
    10: 60,
    11: 90,
}

user_counts = {
    2: 1,
    3: 1,
    4: 1,
    5: 1,
    6: 2,
    7: 2,
    8: 2,
    9: 3,
    10: 3,
    11: 3,
}
